app/views/users/show.html.erb

  <tbody>
    <% @user.comparisons.each do |comparison|%>
---
SELECT "comparisons".* FROM "comparisons" WHERE "comparisons"."user_id" = $1  [["user_id", 1]]