app/controllers/comparisons_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comparisons" ("superior_movie_id", "interior_movie_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["superior_movie_id", 2], ["interior_movie_id", 1], ["user_id", 1]]
---
  def create
    user = User.find(params[:user][:id])
    Comparison.create(user_id: user.id,
                      superior_movie_id: params[:comparison][:superior_movie_id],
                      interior_movie_id: params[:comparison][:interior_movie_id])