app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies"
SELECT "comparisons".* FROM "comparisons" WHERE "comparisons"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @movies = Movie.all
    @comparison = Comparison.new
    @comparisons = Comparison.all